config.org
# -*- eval: (add-hook 'after-save-hook #'tangle-init-files nil t); evil-lookup-func: helpful-at-point; -*-
#+title: Emacs Configuration
#+author: Chris Barrett
#+property: header-args :results silent
#+property: header-args:emacs-lisp :tangle "config.el" :lexical yes
#+startup: fold

This file uses org-mode's tangle functionality to create both the
=early-init.el= and =init.el= files used by Emacs during the startup sequence.

Headings can be tagged with =:disabled:= to 'comment-out' those blocks.

* Early Init
:PROPERTIES:
:header-args:emacs-lisp: :tangle "early-init.el" :lexical yes
:END:
=early-init.el= is used to set certain variables very early in the startup
sequence. This lisp is evaluated before the graphical context and package
manager are initialised.

The tangled file is checked in to git to ensure this Emacs config starts up
correctly from a fresh checkout.

#+begin_src emacs-lisp
  ;;; early-init.el -- Run at the beginning of Emacs startup sequence.  -*- lexical-binding: t; buffer-read-only: t; -*-

  ;;; Commentary:

  ;; This file was generated by org-babel from config.org and should not be edited
  ;; directly.

  ;;; Code:
#+end_src

** Set an environment variable so children can detect that they're inside Emacs
#+begin_src emacs-lisp
  (setenv "INSIDE_EMACS" "true")
#+end_src

** Crank up the max size of subprocess output to read.
This is needed for language servers to perform well, since they communicate
using large chunks of JSON. See:
- [[https://emacs-lsp.github.io/lsp-mode/page/performance/][Performance - LSP Mode - LSP support for Emacs]]

#+begin_src emacs-lisp
  (setq read-process-output-max (* 1024 1024))
#+end_src

** Make this checkout directory the value for ~user-emacs-directory~
This makes it possible to run a version of this config checked out to a git
worktree, for instance, and have all lisp config resolved relative to this
early-init file.

#+begin_src emacs-lisp
  (setq user-emacs-directory (file-name-directory (or load-file-name (buffer-file-name))))
#+end_src

** Disable package.el to improve startup time
Disable =package.el=, since it increases startup time and I use
[[https://github.com/nix-community/emacs-overlay][nix-community/emacs-overlay]] to handle package installation.

#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
#+end_src

** Increase GC limit to reduce collections during startup
Garbage collection runs slow down the Emacs startup sequence. Temporarily
increase settings. We will set final values at the end of the startup sequence.

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum)
  (setq gc-cons-percentage 0.7)
#+end_src

** Put the ELN cache directory in an XDG-conformant place
#+begin_src emacs-lisp
  (when (boundp 'comp-eln-load-path)
    (let ((cache-dir "~/.cache/emacs/eln-cache/"))
      (mkdir cache-dir t)
      (add-to-list 'comp-eln-load-path cache-dir)))
#+end_src

** Enable pixel-wise frame resizing
This helps tiling window managers apply the right size to Emacs frames.
#+begin_src emacs-lisp
  (setq frame-resize-pixelwise t)
#+end_src

** Disable menu bars, etc
Disable window chrome that doesn't make sense in a keyboard-driven UI.
#+begin_src emacs-lisp
  (custom-set-variables '(menu-bar-mode nil)
                        '(tool-bar-mode . nil)
                        '(scroll-bar-mode nil))

  (modify-all-frames-parameters '((vertical-scroll-bars)))
#+end_src

** Customise the titlebar

*** Show just 'Emacs' for window manager title bar
#+begin_src emacs-lisp
  (setq frame-title-format "Emacs")
#+end_src

*** Make the title bar more natural in macOS
#+begin_src emacs-lisp
  (when (equal system-type 'darwin)
    (setq ns-use-proxy-icon nil)
    (modify-all-frames-parameters '((ns-appearance . dark)
                                    (ns-transparent-titlebar . t))))
#+end_src

** Set source directory
Set the location where Emacs looks for its C source files. This is needed to
view the definitions of special forms implemented in C.

The path to sources in the nix-store is injected via an environment variable.

#+begin_src emacs-lisp
  (setq source-directory (expand-file-name emacs-version (getenv "NIX_EMACS_SRC_DIR")))
#+end_src

** Set PATH correctly on Darwin
macOS prevents PATH being modified for graphical apps, so the wrapper set up
with Nix won't work. Use another environment variable to pass through the
desired value.

#+begin_src emacs-lisp
  (autoload 'string-join "subr-x")

  (when (equal system-type 'darwin)
    (dolist (dir (split-string (getenv "NIX_EMACS_DARWIN_PATH_EXTRAS") ":"))
      (push dir exec-path))
    (setq exec-path (seq-uniq exec-path))

    (setenv "PATH" (string-join exec-path ":")))
#+end_src

* File header
#+begin_src emacs-lisp
  ;;; config.el -- User init file for Emacs.  -*- lexical-binding: t; buffer-read-only: t; -*-

  ;;; Commentary:

  ;; This file was generated by org-babel from config.org and should not be edited
  ;; directly.

  ;;; Code:
#+end_src

* Debugging
Hook into the startup lifecycle to report useful debugging information. Note
that these leverage the ~DEPTH~ argument so that subsequent functions added to
~after-init-hook~ are still ordered correctly.

** Show profiler report if startup took too long
#+begin_src emacs-lisp
  (require 'profiler)

  (defvar startup-debugger-report-enabled-p t
    "Whether to show the debugger if startup takes to long.

  This can be disabled in the site file.")

  (defvar startup-debugger-report-threshold-seconds 1)

  (defun config-start-debugger-on-startup ()
    (when startup-debugger-report-enabled-p
      (profiler-start 'cpu)))

  (defun config-stop-debugger-on-startup ()
    (when startup-debugger-report-enabled-p
      (profiler-stop)
      (let* ((now (current-time))
             (total-startup-time (float-time (time-subtract now emacs-start-time))))
        (unless (time-less-p total-startup-time
                             (seconds-to-time startup-debugger-report-threshold-seconds))
          (profiler-report)))))

  (unless noninteractive
    (add-hook 'after-init-hook #'config-start-debugger-on-startup -99)
    (add-hook 'after-init-hook #'config-stop-debugger-on-startup 99))
#+end_src

** Enable debugging for duration of startup sequence
#+begin_src emacs-lisp
  (setq debug-on-error t)

  (add-hook 'after-init-hook
            (lambda ()
              (setq debug-on-error nil))
            98)
#+end_src

** Log startup time duration
Note that tests refer to ~total-startup-duration~, so it should not be inlined.
#+begin_src emacs-lisp
  (defvar after-init-start-time)
  (defvar total-startup-duration)

  (add-hook 'after-init-hook (lambda ()
                               (setq after-init-start-time (current-time)))
            -97)

  (add-hook 'after-init-hook (lambda ()
                               (let* ((now (current-time))
                                      (after-init-duration (float-time (time-subtract now after-init-start-time))))
                                 (setq total-startup-duration (float-time (time-subtract now emacs-start-time)))
                                 (message "after-init completed (%.3f hook duration, %.3f seconds total startup time)"
                                          after-init-duration
                                          total-startup-duration)))
            97)
#+end_src

* Startup

** Tune garbage collection
See: [[https://bling.github.io/blog/2016/01/18/why-are-you-changing-gc-cons-threshold/][Why are you changing gc-cons-threshold?]]
#+begin_src emacs-lisp
  (defvar config-default-gc-threshold 800000)

  (defun config--inhibit-gc ()
    (setq gc-cons-threshold most-positive-fixnum))

  (defun config--enable-gc ()
    (setq gc-cons-threshold config-default-gc-threshold))
#+end_src

*** Restore GC settings after init sequence has completed
#+begin_src emacs-lisp
  (add-hook 'after-init-hook #'config--enable-gc)
#+end_src

*** Prevent GCs during user input in the minibuffer
#+begin_src emacs-lisp
  (add-hook 'minibuffer-setup-hook #'config--inhibit-gc)
  (add-hook 'minibuffer-exit-hook #'config--enable-gc)
#+end_src

** Start server
#+begin_src emacs-lisp
  (unless noninteractive
    (server-start))
#+end_src

** Define a function to select a value depending on the current OS theme
#+begin_src emacs-lisp
  (defun gtk-theme-class ()
    (with-temp-buffer
      (ignore-errors
        (call-process "gsettings" nil t nil
                      "get" "org.gnome.desktop.interface" "gtk-theme"))
      (if (string-match-p "dark" (buffer-string))
          'dark
        'light)))

  (defun macos-theme ()
    (with-temp-buffer
      (ignore-errors
        (call-process "defaults" nil t nil
                      "read" "-g" "AppleInterfaceStyle"))
      (if (string-match-p "dark" (buffer-string))
          'dark
        'light)))

  (cl-defun choose-by-system-theme (&key light dark)
    (let ((theme
           (pcase system-type
             ('gnu/linux (gtk-theme-class))
             ('darwin (macos-theme)))))
      (if (equal 'dark theme)
          dark
        light)))
#+end_src

** Set background colour based on OS theme
Set reasonable placeholder foreground and background colours until the theme is
loaded. Use the current WM theme to determine whether to use light or dark colours.

#+begin_src emacs-lisp
  (set-background-color (choose-by-system-theme :dark "#282c34" :light "#FDF6E3"))
  (set-foreground-color (choose-by-system-theme :dark "#bbc2cf" :light "#556b72"))
#+end_src

** =use-package= - DSL for Lisp package configuration
See: [[https://github.com/jwiegley/use-package][jwiegley/use-package]]
#+begin_src emacs-lisp
  (with-no-warnings
    (setq use-package-always-defer t)
    (setq use-package-minimum-reported-time 0.05)
    (setq use-package-compute-statistics t)
    (setq use-package-verbose (not noninteractive)))

  (eval-when-compile
    (require 'use-package))
  #+end_src

Define a helper function for loading files with =use-package='s timing functionality.

#+begin_src emacs-lisp
  (autoload 'use-package-require "use-package-core")

  (defun load-file-with-stats (file)
    (let ((name (intern (file-name-sans-extension (file-name-nondirectory file)))))
      (eval
       (macroexp-progn
        (use-package-concat
         (when use-package-compute-statistics
           `((use-package-statistics-gather :config ',name nil)))
         (use-package-require file)
         (when use-package-compute-statistics
           `((use-package-statistics-gather :config ',name nil))))))))
#+end_src

** =general= - Provides a rich key-binding DSL supported by =use-package=
See: [[https://github.com/noctuid/general.el][noctuid/general.el]]
#+begin_src emacs-lisp
  (use-package general
    :demand t)
#+end_src

** =delight= - Change or hide minor-mode lighters
#+begin_src emacs-lisp
  (use-package delight
    :demand t)
#+end_src

** Load features used often in config
#+begin_src emacs-lisp
  (require 'dash)
  (require 'f)
  (require 'subr-x)
  (require 'seq)
  (require 'seq-extras (expand-file-name "lisp/seq-extras.el" user-emacs-directory))
  (require 'ht)
#+end_src

** Load =cl= early to avoid warnings caused by reorganised functions in Emacs 27+
#+begin_src emacs-lisp
  (with-no-warnings
    (require 'cl))
#+end_src

** Load autoloads
I slam all package autoloads into a single file and read them in here.
#+begin_src emacs-lisp
  (load-file-with-stats (expand-file-name "config-autoloads.el" user-emacs-directory))
#+end_src

** Configure paths and config layout
#+begin_src emacs-lisp
  (require 'paths (ignore-errors (expand-file-name "paths.el" user-emacs-directory)))
  (paths-initialise)
#+end_src

*** Configure =no-littering= to use these paths
Customises many packages to create a cleaner =.emacs.d= layout.
See: [[https://github.com/emacscollective/no-littering][emacscollective/no-littering]]

#+begin_src emacs-lisp
  (use-package no-littering
    :demand t
    :init
    (setq no-littering-etc-directory paths-etc-directory)
    (setq no-littering-var-directory paths-cache-directory))
#+end_src

*** Teach =recentf= to use these paths
#+begin_src emacs-lisp
  (use-package recentf
    :after no-littering
    :config
    (add-to-list 'recentf-exclude no-littering-etc-directory)
    (add-to-list 'recentf-exclude no-littering-var-directory))
#+end_src

** Load site settings
Load host-specific settings, which are not checked into version control.
#+begin_src emacs-lisp
  (defconst user-site-file (expand-file-name "site.el" user-emacs-directory))

  (when (file-exists-p user-site-file)
    (load-file-with-stats user-site-file))
#+end_src

* 🖌️ Colour theme

** Define a quick-and-dirty utility for smashing face specs together
#+begin_src emacs-lisp
  (defun append-faces (&rest specs)
    `((t ,@(ht-to-plist (seq-reduce
                         (pcase-lambda (acc `((,_pred . ,attrs)))
                           (ht-merge acc (ht-from-plist attrs)))
                         specs
                         (ht-create))))))
#+end_src

